{"posts":[{"title":"关于学历","text":"学历，不过是“学力”的一种伪证罢了。 我能感受到学历越来越不值钱了。 从小时候起，我就不是一个喜欢学习、喜欢学校的孩子。 我现在倒是很喜欢学习，但依然不喜欢学校，不喜欢听老师讲课，不喜欢做学校里那些琐碎的事。 所以我没有读研。 本科时一如反故的拒绝读研。 工作后即使有动摇，或因为觉得“基础不够扎实”（本质上是学习不够勤奋），或因为觉得“学历title不够”（本质上是自身不够强），而想着升学历。 如果有一天，本科学历真的如此贬值，贬值到硕士需要遍地走，不是硕士连过敲门砖都困难的时候，我可能会去读研。或是为了出国工作，需要以留学为踏板，以及相信在国外读书体验会远胜国内，而去读研。 但是我依然为自己的本科学历而自豪。 凭着它，我足以进入网易，找到合适的工作；凭着它，我和武轻工、桂电科的小伙伴打成一片；学历高有些时候并不是加分项，正如网易校招时大家说的“学历越低进来的越厉害”。 而且学历，也越来越不能说明什么。 在学历崇拜明显的小红书，10个哈佛硕士9个教育学，高学历低能力遍地走的情况下，我越来越不倾向通过学历来判断一个人。 今日之清北，远非昔日之清北（不是说清北和清北学生不强）。 学历贬值，是必然趋势，但学历价值，不是。","link":"/2023/02/15/Thinking/Degree/"},{"title":"My Soul","text":"养成好习惯。 饮食习惯尽力做到一心一意、细嚼慢咽。 睡眠习惯尽量好好睡觉，保障午休和夜眠进入深度睡眠。 休息习惯尽量不去看那些对身心不好的网站。 尽量一心一意，实话实说。 工作习惯工作习惯最重要的地方在于，稳定、合理、不强迫自己，以适应力应变。这样才不会破坏正常的生活 逐渐锻炼，矫正自己的工作习惯（时间安排，沟通，心态调压），使自己能一直健康工作下去。 思考习惯改变坏习惯，不要往一些不好的方向想。 比如不能总想着”减负”，做减法。 行为观产生焦虑很大程度上是因为自己的==行为习惯不对==，包括心理上过于急、压力过于大、想太多等等，客观原因是缺乏自信（错估实际情况）；以及行为上透支、太想表现而==强迫自己==…… 等等，都会产生不健康的身心状态。 简单来说就是要会摆烂、摸鱼，不要让自己难受，但工作进度至少还是在推进；找个宣泄方式。 克服社恐很多时候因为胆小，或不知道该怎么处理、怕负反馈结果，而社恐不敢去找别人 这是需要锻炼和说服自己去克服的 当然总体还是要保持自身本身、天生的 舒适的状态(我还是比较喜欢事，专注，所以还是会更注重，社交能力我可以不喜欢，但不能没有)","link":"/2023/02/14/Thinking/2.%20My%20Soul/"},{"title":"逻辑基点","text":"一切逻辑的原点，一些内心中不会改变的想法。 “若想要不迷茫的活在世上，就需要持续深化自己的精神食粮。” 我想要追求幸福。 毫无疑问，幸福完全是一种主观感受，它不是一个客观词。 因此，到达幸福的路径多种多样，而对我们来说，多种路线的组合可能是最有效的方式。 主观幸福主观幸福，即主观上感到自己幸福。它最适用于一个个正在经历的时刻。无论该时刻是快乐还是苦累，只要我们认同自己所为，我们便感到幸福。 客观幸福客观幸福，即绝大多数人都认同的幸福，且自己也认同的幸福。 比如 有一个自己满意的房子，有花不完的钱，有充实的生活质量，有相对的自由，有喜欢的女朋友。 只要做到这些，我就会感到自己事实上确实很幸福。 这里面，我已经做到了3个，我的目标是实现剩下2个，我就是一个足足够够幸福的人。若缺乏一，便无法在透支情况下依然觉得自己幸福。 第三方幸福主观客观都幸福了，但是其实我们还需要第三方幸福，也就是他人认可我们幸福。 我们很难逃避说自己不需要他人的认可，至少我目前还是需要的。如果我有女朋友，那么我只要得到她的认可就足够；而在这之前，我主要靠值得信赖的朋友的认可（凛，吕宇哲，戴 三角）。 充实生活质量的方式充实的生活质量其实也是分主观和客观的。对我来说，打游戏看书就是充实，但对于广义大众来说，咖啡、拍照、滑雪 这些是充实。总的来说，生活质量需要花钱才能保障。 我们要提醒自己，平时按自己想法来可以，但不能忽略群众事实。 找女朋友的正确方法好的寻找另一半的方法是与自己三观相似的人在线下接触。 线下接触人的方式也有很多，通常直接顺其自然即可。 所以，我们在网上，应初步判断对方基础条件与三观是否达标（网筛），如果不合，直接pass，把精力留给下一个。随后的线下接触便是实际路线。 经验很重要经验能帮助我们在接近幸福的路上少犯错，走正路。知道什么做法不好，不能做，什么做法好，什么必须要做（另一个帮助我们的就是习惯，习惯其实是长久既成的认知产生的结果）。 战胜迷茫，确定自己，All things is right here。MBTI ==我们常常被现实中”紧急”的事情影响，做出偏离的判断；而只有在冷静的测试下，才能得出准确的结论。== 价值观 如果一个人的收入很高，那么ta一定在某些方面有过人之处，ta是很有价值的。 职业素质。对待工作，必须一丝不苟才行，不应该让私事影响了工作质量。如果有人喜欢不知频繁的打扰我的工作，那么我会果断拒绝他。 ==我的价值很高，无论是商业上，还是社会中，我都是一个很优秀的人==。在社会上已经领先了99%的人。拒绝他人向你输出pua和外耗！ 我追求幸福，但我不认为幸福和物质挂钩。我对金钱的欲望不高，即使只有几千块钱我也可以活得很好。不过，在这个世界规则下，男性就是容易赚更多钱而花销更小的。所以金钱，更多是提供和保障两个人的生活质量的。 我非常珍惜时间。所有杰出的人都珍惜时间，但不代表我们就不会拿时间来享受。时间观 非常重要，==我们要准确的评估时间==。 许个目标，敢于做自己，敢于说真话。锻炼！外耗！之所以左右摇摆，就是已经习惯了动摇自己。 在大公司求职中，学历越低反而越厉害，对游戏工作来说，更看项目而非公司，越小的公司越理想。所以，在专业领域，许多道理是与常思维相反的。 人生观 正人君子，王道路线。高学素质，理想环境。受好的影响，不受坏的影响。 好的生活习惯是稳定而自洽的。 我们的习惯造就了我们，所以养成正确的工作生活习惯非常重要。许多不健康的身体或心理问题，往往是不好的习惯造成的。（没有借口！） ==没有必要和与自己三观认知差距都非常大的人往来，因为你们本来就不应该产生瓜葛==。 ==辛苦的工作需要相应的生活质量来回报，所以没必要在不该省的地方节省==。 我理想的工作是做dream游戏的wfh，至少现在是这样，以后会不会变不知道。 人身上有一些劣根的本性，比如懒惰、不劳而获、理想主义，这些劣根性会干扰你对自己三观想法的判断，他们都是“诱惑”，劝说你逃避、放弃。==我们一定要好好分辨自己的想法里哪些是“劣根性作祟”、哪些是“真实的、好的”==。 世界观 ==工作是创造价值并得到回报的过程，要获得相应的回报，首先得创造足够的收益。否则即使有企业愿意支付你报酬，也是维持不久的。而真正好的工作都是可维持的==。（所以，我选择能直接创造收益的UE5游戏开发工作） 人类总体共赢是会往大家都舒适发展，但是局部情况不是的，越是底层的/落后的地方，越容易出现逐利忘义的无下限斗争，而在发达先进的地方，才能保障讲规则讲秩序的人也舒适。 现实情怀与理性决定两者可以并行存在。比如从感性上我会支持ACT游戏梦，但从理性角度看还是做FPS才更长久的适合我。感情也是这样。好的寻找另一半的方法是与自己三观相似的人在线下接触。 性格测试MBTI：INTJ/FJ，内向，直觉，理性，逻辑(实际)，谨慎 FPA：黄色/蓝色，关注事，完成目标导向，有领导能力 适合的职业：工程师、医生等。 ![image-20230215105449357](Logic Base.assets/image-20230215105449357.png) 需求模型测试 需要克服的缺点：完美主义，不愿触及他人，理想倾向而忽略了现实手段的必须性，忽视休息和发泄的渠道，受外界或他人影响而轻易改变自己的价值观（而在平静下会恢复正常） 恋爱其实也是要两个人本质上的性格相容，才可以相处好，而其他事物可能没那么重要（只要不是相冲突的，像爱好、学历、收入等很多是可以在相处过程中形成或改变的）。虽然说爱情是感性的，但很多决定不宜在感性时做，恢复理性时又会饱受其苦… What’s you really like? I don’t care much the outlook and economy. 我不是很看重外表和经济（有一点看重，差不多就可以了），家庭挺重要，但主要在于她个人怎么样（家庭的影响毕竟是有限的），不在乎虚无缥缈的学历，更在乎实际的能力和视野 还有一点很重要的是要有时间和相互扶持。 当然具体情况具体分析，综合情况，弱势项可以用优势项弥补（一定程度上） Intimate Relationship如果你体会过亲密关系的好，就再也回不去了。 我的小屋，很适合恢复精力，但会有点儿容易让我陷入孤独。实际上，人的基因里写着&lt;孤独会带来痛苦&gt;^1，所以这是不好的。“谁不想在喧闹的城市中找到几个能真正与自己建立心灵连接的人呢？” 我有很多方法帮助我逃避孤独，比如不闻、不顾、不问，看书、打游戏、听音乐，甚至沉浸于工作，都是一个人的快乐，每当我遇到挫折时，我就会想到它们——但是，我并没有真正解决孤独。 写博客，遭遇经历，痛苦的实感，寻求自救的过程，让我切实明白解决孤独的必要性。 哲人：……你渴望的==不是“获得幸福”，而是更廉价的“获得快乐”吧？== 青年：…什么？ 哲人：==爱的关系中并非全是快乐，必须承担的责任很大，还会有辛苦和无法预料的苦难。==即使如此，你依然可以去爱吗？无论遇到什么样的困难也要爱这个人并一起走下去，你有这个决心吗？你可以许下这样的诺言吗？ 青年：爱的…责任？ 哲人：例如，有的人一边说着“喜欢花”，一边却任其枯萎，忘记浇水，也不倒盆，把花摆在美观的地方，根本不考虑其向阳性。的确，这个人也喜欢观赏花，这是事实，但却称不上“爱花”。爱是一种更具献身精神的行为。 你的情况也一样。==你一直在回避爱应该背负的责任，只是贪恋爱的果实，既不为花浇水又不修剪。这就是短暂的、享乐性的爱。== 爱有两面，在获得幸福的同时，也会承担来自它的苦难，爱是义无反顾的献身。而现在很多人的恋爱追求的只不过是短暂的快乐。 既然时间有限，那么所有人际关系的成立都是以“分别“为前提。现实就是我们为了分别而相遇。在所有的相遇与人际关系中，不断朝着“最佳分别“而努力，以便有朝一日分别的时候，可以无憾地说“与这个人相遇、一起度过的日子很对很值得“。 职业价值观职业价值观：德中心理测试 总结：喜欢学习和制作新事物，并能得到看得见的正反馈和成果，不喜欢经常被打扰，内容相对稳定不变。 自由发挥，不受时间限制，能帮助到他人并得到领导的支持，不需要受制于人； 并不想拥有高于他人的权力，不断的接触新人，需要不停为人提供服务，理想工作不在乎福利和高额薪酬(但是基本的待遇得有)。 我理想的职业是在理想的企业做一名wfh的程序员，宽松的制度、自由的氛围、稳定的业务和国际化的视野都是我心之所向。 其次就是我目前做的，自由取决于自己的工作。这样的工作做得好坏由自己决定，已经能很大程度上自己把控自己的人生。 没有一个职业是完美的，选择程序员就要面对社交渠道窄、情商使用少、头秃和空闲时间少等问题；但是回报的高薪酬和强学习能力可以一定比例上弥补这些问题。比如通过付费换取非自己领域的高效学习。 我觉得世界上大多数人都是好人，只是没有得到正确的引导，因此我愿意去相信别人；虽然说隐瞒和欺诈等手段依然存在，我们也不知道他人的成长轨迹和当下目的，但是在保全自己的前提下依然愿意去“他者贡献”。 如何帮助他人而减少自己受到的伤害，这是我正在修习的课题。 突然想插一嘴时间观，我觉得自己的很多问题都是时间观没有处理好，我很珍惜时间，但是并不能准确的评估ta，以致于很多次我的事情没有处理好。 锻炼事项 锻炼说不 锻炼说 我能行! 锻炼 ==按照个人意愿花钱，而非根据数额==，背后依然是理性、切实需要（事实上我缺乏经济上的安全感，所以在未受外界影响的时候，我很看重钱。但这很多时候体现的“矫枉过正”，也就是过于珍惜钱。关于恢复一个正确的金钱观和消费观，我可能需要实践）没有绝对正确的消费观 锻炼 矫正自己的坏习惯","link":"/2023/02/16/Thinking/1.%20Logic%20Base/"}],"tags":[{"name":"thinking","slug":"thinking","link":"/tags/thinking/"}],"categories":[{"name":"私人事项","slug":"私人事项","link":"/categories/%E7%A7%81%E4%BA%BA%E4%BA%8B%E9%A1%B9/"}],"pages":[{"title":"","text":"自我介绍我是Kira，曾用的英文名是Garcia Anotts。我是一名UE5开发工程师，曾经也在上学时、网易游戏使用Unity、Messiah引擎开发过一些游戏。我的主要创作生涯经历有： 高宠传（NMFlash 阿诺论坛） 魔塔nzt（Rpg Maker 66RPG） No game no life（光荣战棋SLG制作工具 轩辕春秋） 合金弹头S（Unity） Sunset（Unity 创新杯名次） 黎明之刃（Unity 微软id@xbox入选） CodeInvader（Unity in Netease，MiniGame） 命运：Viper（Messiah） 近月re（Ren’py） 逃学派对（Unreal in Netease，GameJam21获奖） Contractors（Unreal） 此外，也曾短暂参与过peropero、kidfansclub、梦幻西游三维版、鸣潮、铃兰之剑等组织或项目的开发。在这之中，黎明之刃(Dawnblade) 和 代码入侵者(CodeInvader) 使用了我自己设计的开发框架SFramework，这也是我的大学毕业设计成果。 上述经历中有很多发生在我小学到大学的时期，因为我在NCU游戏社（动漫社的分部）组建了创业工作室Sunset Game，以此名义产出了6部以上的游戏，且在校期间与西安科技大学、桂林电子科技大学信息科技学院等高校保持友好协作，举行了部分游戏制作比赛。 我掌握的技能编程语言：C++，C#，Python 游戏开发：Gameplay，关卡，Physics，Workflow（同时Blender一直想学） 日常：健身，做饭，英语，入门日语 我爱好看动漫、踢足球、学习、听歌、做游戏。 事实上工作劳累后最恢复我体力的方法就是听喜欢的音乐和重温经典番剧了。因为看新的，无论动漫、游戏、球赛什么的，都挺累的。 然后做饭、健身之类的有意义的事，也能给我莫大的能量，让我在疲惫之余有一丝空闲舒缓下来。 交友： Favorite Table 喜欢的动漫Little Busters物语系列ef我们没有翅膀灰色三部曲来自新世界 喜欢的游戏ADV：近月系列ARPG：黑暗之魂3FTG：舞空烈战SPG：实况足球ACT：鬼泣DmcSLG：三国大战 喜欢的电影了不起的盖茨比凉宫春日的消失 喜欢的音乐阳炎Project系列Til the star burn blue 喜欢的书籍“勇气系列”时间揭秘 喜欢的小说凉宫春日物语绯弹的亚里亚 喜欢的角色艾斯豚·加拉哈·阿诺兹凛 喜欢的球队英超阿森纳德国队拜仁慕尼黑 还有一些喜欢的因为自己不够资深就没有列出来，比如 Monster Hunter、塞维利亚 Why I write blogs?我为什么要写博客呢？因为我觉得这可以很好的整理自己的知识、心得，而且可以锻炼写作能力（程序员语文表达锻炼欠缺），相比于笔记更规整、正式、书面化。我的博客主要面向受众，是游戏开发者+共同爱好者，作为最理想的心灵交流载体，想在网络世界里寻得一片精神的净土。 写在最后我是一个冷静、理性、善良、沉稳的人。 游戏研发的生涯辛苦而陡峭，但我心中确有梦想实现的游戏，我会努力去接近它。 about","link":"/about/index.html"}]}