{"posts":[{"title":"article","text":"","link":"/2023/02/14/article/"},{"title":"Kira的博客搭建记录","text":"兜兜转转终于还是搭建了自己的博客。 在众多博客方案中选择了Hexo+GitHub部署，Hexo作为博客框架，GitHub仓库托管，按照教程走一遍，基本上就搞定啦。 过程中遇到PowerShell无法运行hexo命令的问题，进行修复。 在阿里云购买了一个域名，garciaanotts.cc，这样访问网站就更方便啦。 ![image-20230214052343543](Kira’s Blog.assets/image-20230214052343543.png) 写一篇博客的正确姿势首先，hexo n “博客名字” 随后，hexo g、hexo d 生成和部署网页，hexo s 本地预览 GitHub和坚果云托管在config.yml中配置网站，其中最后一行为推送到的GitHub分支；config.icarus.yml中配置主题 GitHub新建一个分支，clone到本地，把.git复制过来，放到blog根目录，然后git add . , git commit -m, git push三连，即可将博客源代码放到github托管 而_post文件夹交给坚果云托管","link":"/2023/02/14/Kira's%20Blog/"},{"title":"","text":"女生也能看懂的English教程英语主要分为 听，说，读，写 四个部分，对于一个受良好英语教育的人，ta的四项能力应该是均匀的。 其中，说，也就是口语，是最好上手的部分，因为大部分外国小孩学习语言也是从口语开始的，ta可能不会读和写，但是ta一定会说。 然后是听，最后是读和写，其中写是中国学生最薄弱也最疏于使用的技能。 我建议使用英语环境学英语，但不建议就完全抛弃中文，实际上就我们的使用环境来说，保持中文的练习也是必不可少的。 口语口语方面推荐AndrewCap老师的视频，他是一个很可爱帅气也很用心的宝藏老师，在他的视频中他提到了，最好的学习口语的方式就是”模仿”英语母语者的发音。在他的教程中，你可以学会更多的美式英语地道用词，如”really”代替”very”，”d、t结尾的词发音可以省略”，”I gotchu 我会帮你” 口语更地道的tips： where are you from? 👉where you from?how are you doing? 👉how you doing?what do you want to do? 👉what you wanna do? 还有就是杨帅老师了，雅思口语900句，也是和帅哥学英语😂","link":"/2023/02/15/English%20Teaching%20for%20Girlfriend/"},{"title":"","text":"如何抵御 人性的弱点 物竞天择，适者生存 保持奋斗者心态，才能让你走到哪都能生存下去 Locate：鼠→中产，这之间一定有一个解法 搬家 鼠：自己收拾，自己打包，自己运输(携带)，东西基本必需项，不会贵，总量不太多 中产：雇人 之间：","link":"/2023/02/15/What%20I%20have/"},{"title":"","text":"My Experience LevelDataEntityUI HitchSFXMatUIdownload ccs 3.1 界面 just like that we need focus ui node, layout, project node, widget. Visible, Activeable, pos, scale, anchor… etc Maybe UI KeypointCocos UIit seems to cocos ui but not equal.. anchor, position, size, best fit text, color, etc.. 不懂的：alignment 差异cocosui基于","link":"/2023/02/15/Messiah/"},{"title":"记第一次头皮护理","text":"人在北京，冬天太干燥了，头皮屑很严重，2天就要洗一次头但还是防不了头皮屑。适逢被推销，于2-14前往木子护肤造型尝试头皮护理。 完整做一次的时间也不长，半个小时左右。之后前几周每周去一次，随后可以减缓。 头皮屑原因是脂溢性皮炎，也是因为用脑过多、熬夜导致皮脂腺出油过多，和饮食、激素变化也有很大关系。 掉头发也是类似的原因，因为头皮出油多。我这次是将清洁+去屑+补水一次都做，最后回家后还得每天用头皮清洁剂洗发。 会洗头发？你会洗头皮吗？20年专业护理经验教你正确洗头教程 洗头主要洗头皮，要上两遍洗发水，并按摩头皮，每一次冲洗都要彻底冲洗干净。 烫染发也会对头皮产生影响，因为破坏了皮肤屏障。轻度的注意休息调养，减少皮脂分泌就好了。 参考 【医学博士】你会有头皮屑困扰问题吗？健康人会有头皮屑吗？ 药物类型1.角质层剥脱剂（市面上的去屑产品适用于症状较轻者）2.细胞生长抑制剂（刺激性较大，可能损害发质）3.抗微生物抑制剂（效果最好，安全性最高，但有不良反应还是要停止使用） 市场上能卖的去屑产品的成分含量较低，所以效果只适合轻度。专业的还是需要去医院检测，然后对症下药（医院最保障健康）。 顺便，今天情人节，花市好火爆啊~~要买花的话建议提前预定好，可以问女孩子喜欢什么花，让她知道你是想送花给她，然后问她有没有收货地址，并且表示你会把花送到她家，就可以不经意的送花给她了。 当然，也可以送巧克力。 但是，不建议盲目送，因为有乞讨的女生，会向你要求送这个送那个，你跟她说明送不了的原因她会说你虚伪，这样的就不值得送了。","link":"/2023/02/14/Experience/ScalpCare/"},{"title":"","text":"基础调试断点 监视 日志 进阶调试增量修改（删去或增加一段内容后编译运行，看是否有什么区别）[定位] DebugDraw 修改变量 AttachToProcess 远程调试 奇技淫巧颜色调试（替换Color） 高级调试查看内存布局 汇编代码 gdb调试","link":"/2023/02/15/%E8%B0%83%E8%AF%95%E5%A4%A7%E5%85%A8/"},{"title":"My Life","text":"饮食健康 饮食原则：谷物+蔬菜+鲜肉(鱼禽虾牛)+蛋白+牛奶 推荐午餐：鱼香肉丝，香菇炒青菜，炝花菜 肉沫茄子，百合虾，炒青菜 孜然羊肉，番茄炒蛋，油麦菜 轻食，炖汤 作息习惯理想的作息时间是晚23早7，不过由于工作目前早11晚8，所以容易推迟（将自己工作时间调整到早10晚7会好点，晚上的时间分配也会比较固定，然后睡眠晚24早8——best choice!） 一定要午休！中午2小时休调不可或缺（已经成生物钟了） 工作习惯工作习惯对生活的影响其实是无处不在的","link":"/2023/02/15/Thinking/MyLife/"},{"title":"关于学历","text":"学历，不过是“学力”的一种伪证罢了 我能感受到学历越来越不值钱了。 从小时候起，我就不是一个喜欢学习、喜欢学校的孩子。 我现在倒是很喜欢学习，但依然不喜欢学校，不喜欢听老师讲课，不喜欢做学校里那些琐碎的事。 所以我没有读研。 本科时一如反故的拒绝读研。 工作后即使有动摇，或因为觉得“基础不够扎实”（本质上是学习不够勤奋），或因为觉得“学历title不够”（本质上是自身不够强），而想着升学历。 如果有一天，本科学历真的如此贬值，贬值到硕士需要遍地走，不是硕士连过敲门砖都困难的时候，我可能会去读研。或是为了出国工作，需要以留学为踏板，以及相信在国外读书体验会远胜国内，而去读研。 但是我依然为自己的本科学历而自豪。 凭着它，我足以进入网易，找到合适的工作；凭着它，我和武轻工、桂电科的小伙伴打成一片；学历高有些时候并不是加分项，正如网易校招时大家说的“学历越低进来的越厉害”。 而且学历，也越来越不能说明什么。 在学历崇拜明显的小红书，10个哈佛硕士9个教育学，高学历低能力遍地走的情况下，我越来越不倾向通过学历来判断一个人。 今日之清北，远非昔日之清北（不是说清北和清北学生不强）。 学历贬值，是必然趋势，但学历价值，不是。","link":"/2023/02/15/Thinking/Degree/"},{"title":"","text":"CharacterMovement为Capsule定制的主角移动组件 UPROPERTYGravityScale MaxStepHeight: 可踩上的最大高度 JumpZVelocity: 跳跃时的初始速度（瞬时垂直加速度） JumpOffJumpZFactor: 当角色自动从一个不可落地的位置”跳下来”时的JumpZVelocity的分数 MovementMode CustomMovementMode NetworkSmoothingMode GroundFriction MaxWalkSpeed: 同时也是falling时的最大横向速度 MaxWalkSpeedCrouched: 行走和蹲伏时的最大地面速度 MaxSwimSpeed MaxFlySpeed MaxCustomMovementSpeed MaxAcceleration MinAnalogWalkSpeed: 当以最小模拟杆倾斜行走时，我们应该加速到的地面速度 BrakingFrictionFactor: 用于乘以Brake时使用的实际摩擦值的系数 AirControl: 0-1 AirControlBoostMultiplier: 当横向速度小于阈值时，AirControl会乘上的系数（设为0关闭AircontrolBoosting，最终值不会超过1） AirControlBoostVelocityThreshold: 阈值，设为0表示关闭Boost FallingLateralFriction: 横向阻力 CrouchedHalfHeight: 总结： Walking里面默认只有水平方向的移动，只有遇到斜面的时候才会根据斜面角度产生Z轴方向的速度 Falling里会处理横向加速度和纵向(重力)加速度 Flying里是自驱动6向移动 Custom里的CalcVelocity+SafeMoveUpdatedComponent+SlideAlongSurface只能处理无重力的定制移动，并计算Fraction和BrakeDecceleration PhysWalking地面模拟 FFindFloorResult CurrentFloor 在游戏一开始的时候，移动组件会根据配置设置默认的MovementMode，如果是Walking，就会通过FindFloor操作来找到当前的地面 FindFloor本质上就是通过胶囊体的Sweep检测来找到脚下的地面，所以地面必须要有物理数据，而且通道类型要设置与玩家的Pawn有Block响应。 这里还有一些小的细节，比如我们在寻找地面的时候，只考虑脚下位置附近的，而忽略掉腰部附近的物体；Sweep用的是胶囊体而不是射线检测，方便处理斜面移动，计算可站立半径等（参考图3-3，HitResult里面的Normal与ImpactNormal在胶囊体Sweep检测时不一定相同）。 找到地面玩家就可以站立住么？不一定。这又涉及到一个新的概念PerchRadiusThreshold，我称他为可栖息范围半径，也就是可站立半径。默认这个值为0，移动组件会忽略这个可站立半径的相关计算，一旦这个值大于0.15，就会做进一步的判断看看当前的地面空间是否足够让玩家站立在上面。 前面的准备工作完成了，现在正式进入Walking的位移计算，这一段代码都是在PhysWalking里面计算的。为了表现的更为平滑流畅，UE4把一个Tick的移动分成了N段处理（每段的时间不能超过MaxSimulationTimeStep）。在处理每段时，首先把当前的位置信息，地面信息记录下来。在TickComponent的时候根据玩家的按键时长，计算出当前的加速度。随后在CalcVelocity()根据加速度计算速度，同时还会考虑地面摩擦，是否在水中等情况。 12// apply input to accelerationAcceleration = ScaleInputAcceleration(ConstrainInputAcceleration(InputVector)); 算出速度之后，调用函数MoveAlongFloor()改变当前对象的坐标位置。在真正调用移动接口SafeMoveUpdatedComponent()前还会简单处理一种特殊的情况——玩家沿着斜面行走。正常在walking状态下，玩家只会前后左右移动，不会有Z方向的移动速度。如果遇到斜坡怎么办？如果这个斜坡可以行走，就会调用ComputeGroundMovementDelta()函数去根据当前的水平速度计算出一个新的平行与斜面的速度，这样可以简单模拟一个沿着斜面行走的效果，而且一般来说上坡的时候玩家的水平速度应该减小，通过设置bMaintainHorizontalGroundVelocity为false可以自动处理这种情况。 现在看起来我们已经可以比较完美的模拟一个移动的流程了，不过仔细想一下还有一种情况没考虑到。那就是遇到障碍的情况怎么处理？根据我们平时游戏经验，遇到障碍肯定是移动失败，还可能沿着墙面滑动一点。UE里面确实也就是这么处理的，在角色移动的过程中（SafeMoveUpdatedComponent），会有一个碰撞检测流程。由于UPrimitiveComponent组件才拥有物理数据，所以这个操作是在函数UPrimitiveComponent::MoveComponentImpl里面处理的。下面的代码会检测移动过程中是否遇到了障碍，如果遇到了障碍会把HitResult返回。 1234FComponentQueryParams Params(PrimitiveComponentStatics::MoveComponentName, Actor);FCollisionResponseParams ResponseParam;InitSweepCollisionParams(Params, ResponseParam);bool const bHadBlockingHit = MyWorld-&gt;ComponentSweepMulti(Hits, this, TraceStart, TraceEnd, InitialRotationQuat, Params); 在接收到SafeMoveUpdatedComponent()返回的HitResult后，会在下面的代码里面处理碰撞障碍的情况。 如果Hit.Normal在Z方向上有值而且还可以行走，那说明这是一个可以移动上去的斜面，随后让玩家沿着斜面移动 判断当前的碰撞体是否可以踩上去，如果可以的话就试着踩上去，如果过程中发现没有踩上去，也会调用SlideAlongSurface()沿着碰撞滑动。 基本上的移动处理就完成了，移动后还会立刻判断玩家是否进入水中，或者进入Falling状态，如果是的话立刻切换到新的状态。由于玩家在一帧里面可能会从Walking，Swiming，Falling的等状态不断的切换，所以在每次执行移动前都会有一个iteration记录当前帧的移动次数，如果超过限制就会取消本次的移动模拟行为。 PhysFalling玩家在空中即进入Falling状态（无论是跳起还是下落），首先它计算横向加速度（是否受AirControl限制），随后它开始计算受重力影响的纵向加速度。 有个特点是为了表现的更平滑流畅，Phys都是支持Iterations将一个Tick切成N段时间来处理的（每段的时间不能超过MaxSimulationTimeStep）。在处理每段时，首先计算玩家通过输入控制的水平速度，随后，获取重力计算速度。重力的获取有点意思，你会发现他是经过Volume体积获取的（GetGravityZ→GetPhysicsVolume()-&gt;GetGravityZ * GravityScale→MyWorld-&gt;GetGravityZ() / UPhysicsSettings::Get()-&gt;DefaultGravityZ），最终拿到的是World里设置的GravityZ或者PhysicsSetting里的DefaultGravityZ 接下来处理Force驱动的跳跃：如果设置了ApplyGravityWhileJumping=false，要把Jump force time的部分从重力计算的GravityTime中移去 通过获取到的Gravity计算出当前新的FallSpeed（NewFallVelocity里面计算，计算很简单，就是单纯的用当前速度+Gravity*deltaTime），再限制一下Don’t exceed terminal velocity。 随后再根据当前以及上一帧的速度计算出位移并进行移动，公式如下 FVector Adjusted = 0.5f*(OldVelocity + Velocity) * timeTick; SafeMoveUpdatedComponent( Adjusted, PawnRotation, true, Hit); PhysCustomPhysLadder: SafeMoveUpdatedComponent: Calls MoveUpdatedComponent(), handling initial penetrations by calling ResolvePenetration(). If this adjustment succeeds, the original movement will be attempted again. SlideAlongSurface: 由于SafeMove会传入HitResult来处理初始穿透，那么当Hit.Time&lt;1时，说明发生了穿透，要交给SlideAlongSurface来处理成表面滑动效果 PhysWalking: 只是检查当玩家输入wantsToSprint+Crouch时会变成滑铲，即SetMovementMode→Sliding，其他还是默认。 PhysParachutingFriction：在不加速时或在与加速相反的方向上的摩擦系数。 Braking Deceleration：无加速或超过最大速度时施加的减速。 所以我们在Falling切Parachuting后，它速度会接近0（通过Friction) 那么我们在速度-1000的时候，改Friction为0，这时，它的速度应该就是恒定的 UE4是封装好了很多功能，你只需看它的文档或示例来使用，不需要知道它的底层，但是它的底层是复杂和晦涩难懂的，如果不看和修改底层就能实现是最好的，但如果绕不开就还是要改底层 Fall是在PhysFalling里将Gravity加速度计算到Velocity中了的，Custom里没有处理，所以Z速度最后会趋近0。Custom里我们只用了CalcVelocity，它基于当前状态更新“速度”和“加速度”，不施加重力。 一开始是Falling，开伞变Parachuting，这时给一个与重力反向的加速度，该加速度随速度的减小而减小，最后等于重力加速度","link":"/2023/02/15/Movement%E6%BA%90%E7%A0%81%E5%88%86%E6%9E%90/"},{"title":"UE5 蓝图完全教程","text":"最好的入门UE5的方式——蓝图 结点AttachActorToComponent将Actor附加到Component FAttachmentRule： KeepRelative 适合将Actor的Transform设为相对位置，附加后将保持该相对位置 KeepWorld 适合将Actor的Transform设为世界位置，附加时将自动换算该世界位置为相对位置 SnapToTarget 将Transform捕捉到目标点 告知该Actor被Attach了用蓝图事件通信 给该Actor添加CustomEvent 父Actor调用Call CustomEvent，并将所需参数传过去 Soft Object Reference 软引用软引用可以引用还没创建或者异步加载的对象 创建出来了的就还是用硬引用吧 插件推荐blueprintUE","link":"/2023/02/15/Unreal/UE5%20Blueprint%20Tutorial/"},{"title":"My Soul","text":"自我介绍我是一个冷静、理性、善良、沉稳的人 性格测试结果我们常常被现实中”紧急”的事情影响，做出偏离的判断；而只有在冷静的测试下，才能得出准确的结论。 MBTI：INTJ/FJ，内向，直觉，理性，逻辑(实际)，谨慎 FPA：黄色/蓝色，关注事，完成目标导向，有领导能力 适合的职业：工程师、医生等。 需求模型测试 需要克服的缺点：完美主义，不愿触及他人，理想倾向而忽略了现实手段的必须性，忽视休息和发泄的渠道，受外界或他人影响而轻易改变自己的价值观（而在平静下会恢复正常） 恋爱其实也是要两个人本质上的性格相容，才可以相处好，而其他事物可能没那么重要（只要不是相冲突的，像爱好、学历、收入等很多是可以在相处过程中形成或改变的）。虽然说爱情是感性的，但很多决定不宜在感性时做，恢复理性时又会饱受其苦… What’s you really like? I don’t care much the outlook and economy. 我不是很看重外表和经济（有一点看重，差不多就可以了），家庭挺重要，但主要在于她个人怎么样（家庭的影响毕竟是有限的），不在乎虚无缥缈的学历，更在乎实际的能力和视野 还有一点很重要的是要有时间和相互扶持。 当然具体情况具体分析，综合情况，弱势项可以用优势项弥补（一定程度上） 人生观我理想的职业是做一名外企wfh的程序员，外企宽松的制度、自由的氛围、稳定的业务和国际化的视野都是我心之所向。 其次是做游戏外企的程序员，以及我目前做的，自由取决于自己的工作。这样的工作虽然不是最优，但已经能很大程度上自己把控自己的人生。 没有一个职业是完美的，选择程序员就要面对社交渠道窄、情商使用少、头秃和空闲时间少等问题；但是回报的高薪酬和强学习能力可以一定比例上弥补这些问题。比如通过付费换取非自己领域的高效学习。 我觉得世界上大多数人都是好人，只是没有得到正确的引导，因此我愿意去相信别人；虽然说隐瞒和欺诈等手段依然存在，我们也不知道他人的成长轨迹和当下目的，但是在保全自己的前提下依然愿意去“他者贡献”。 如何帮助他人而减少自己受到的伤害，这是我正在修习的课题。 突然想插一嘴时间观，我觉得自己的很多问题都是时间观没有处理好，我很珍惜时间，但是并不能准确的评估ta，以致于很多次我的事情没有处理好。 价值观职业价值观：德中心理测试 总结：喜欢学习和制作新事物，并能得到看得见的正反馈和成果，不喜欢经常被打扰，内容相对稳定不变。 自由发挥，不受时间限制，能帮助到他人并得到领导的支持，不需要受制于人； 并不想拥有高于他人的权力，不断的接触新人，需要不停为人提供服务，理想工作不在乎福利和高额薪酬(但是基本的待遇得有)。 关于金钱，我想要请教咨询事实上我缺乏经济上的安全感，所以在未受外界影响的时候，我很看重钱。但这很多时候体现的“矫枉过正”，也就是过于珍惜钱。关于如何恢复一个正确的金钱观和消费观，我想我可能需要咨询实践。 为什么价值观总是左右摇摆很大程度上是因为强迫没得选 没有坚持自己喜欢的事，随后不够自信，打破原则 行为观产生焦虑很大程度上是因为自己的==行为习惯不对==，包括心理上过于急、压力过于大、想太多等等，客观原因是缺乏自信（错估实际情况）；以及行为上透支、太想表现而==强迫自己==…… 等等，都会产生不健康的身心状态。 简单来说就是要会摆烂、摸鱼，不要让自己难受，但工作进度至少还是在推进；找个宣泄方式。 克服社恐很多时候因为胆小，或不知道该怎么处理、怕负反馈结果，而社恐不敢去找别人 这是需要锻炼和说服自己去克服的 当然总体还是要保持自身本身、天生的 舒适的状态(我还是比较喜欢事，专注，所以还是会更注重，社交能力我可以不喜欢，但不能没有)","link":"/2023/02/14/Thinking/MySoul/"},{"title":"","text":"VRInteractableActor首先，继承ZomboyInteractableActor蓝图 Mesh通常将Scene或者Mesh作为RootComponent（StaticMesh: Mesh: Primitive: SceneComp） Mesh里提供了OverrideMaterials的配置(TArray)，但它还不能直接拿来用，它只是各种Mesh组件的抽象基类。而StaticMeshComp里缓存了UStaticMesh的引用，因此它可以对其进行操作 InteractionComponent配置触发交互的范围 (ZomboyShapeComponent) 配置GripType：Follow(手跟随物)或Grab(物跟随手) 配置MaxConcurrent: 可以几只手交互 InteractionDetectionDistance 手离开交互范围，会自动结束Interaction GeneralIndicatorTransfrom尽量不要修改，因为它会控制整体，可能会造成意想不到的效果 表示交互时手的位置，该位置应与控制器握持位置接近，且和触发交互的范围相近 配置手各个拇指的位置 HandPose 配置控制器位置 ControllerRelative（点控制器出现的圆球是整体的变换点，注意！控制器没有变换点）应放在你想让手柄放的位置 配置手的位置 HandRelative (手的控制点在手掌根部那个点) 应放在你想表现的预期位置 需要注意的是，这两个都是RelativeTransform，它会相对Indicator结点的Transform进行变化 配置左手还是右手交互 HandUsage 实现抓取移动比如上下移动 原理：在OnPreGripUpdateEvent事件里 GetDesiredHandPoseTransformWorldSpace（控制器位置）- GetTargetHandPoseTransformWorldSpace（手部模型当前位置）= 控制器输入的偏移值 上下移动就是取Z分量的值，如果要限制一帧移动的范围，就再Clamp一下VectorSize。得到的向量作为Actor的LocalOffset 更进一步，由于只是ClampVectorSize无法限定交互物移动的范围，所以我们还要对交互物最终的Location进行一下Clamp: SetHandPoseTransformWorldSpce设置手最终的位置，SetRelativePosition设置交互物自身的位置 优化抓取移动目前的抓取移动在手离开交互范围强制退出交互时，交互会出问题，导致下一次交互触发失败。 加入Interaction IsValid判断即可解决这个问题。 怎么实现左手交互从右手复制，设置HandUsage为Left，然后Visualization里面设置 MotionSourceIsRightHand False，这决定是预览左手还是右手动作。设置右手时，时常看一下左手的效果，这样才不会错 把交互物加到主角身上用ChildActor或AttachActorToComponent 例：ClimbPipe它是用ClimbComponent实现PhysClimb的移动模式，交互上它FindTransformClosestToWorldLocation 例：Door逻辑事件：OnPreGripUpdateEvent(前后推Interaction)→SetHandPoseTransformWorldSpace→SetWorldRotationOnPreGripUpdateEvent(DoorNob门把手)→GetDesiredHandPoseTransformWorldSpace→SetTargetLocation（Target是PhysicsHandle2）OnHandInteractionBegin/EndEvent→Add/Destroy PhysicsHandleComponent→Set DoorNobPhysicsHandle2→GrabComponent AtLocation(Door→Desired HandPose Transform Location) 例：RockerDianzha它计算Switch的RelativeRotation，同时更新手部的旋转SetHandPoseTransform","link":"/2023/02/15/Zomboy/VRInteractableActor%20in%20Zomboy/"},{"title":"","text":"C# Birth Anders Hejlsberg Microsoft CLI .NET CLR WinForms C#的特质 using namespace 一切都基于class 丰富的Class Library Value Type &amp; Ref Type 多元的访问修饰符 enum 运算符重载 设计简洁优雅，格式统一 熟练度 int? ?. [,] string=String interface #define Attribute[ ] get; set; delegate, event; 泛型 常见API ToString() Convert. Console. System.ValueType String.Contains() ……. 工作手游的目标用户，根本就不是我们这些做游戏的”硬核玩家” Unity拿来做不复杂的游戏时（内置功能可以覆盖90%功能时），是不折磨的，体验很好的（前提自己不折磨自己）","link":"/2023/02/15/assets/%E4%B8%96%E7%95%8C%E4%B8%8A%E6%9C%80%E5%A5%BD%E7%9A%84%E8%AF%AD%E8%A8%80%20C#/"},{"title":"","text":"C++ Evolved Bjarne Stroustrup STL Template Mulitithread C++ Evolve C# Global Domain #include *, &amp;, sizeof（其实C#也有） 库的用法相对不统一（stl像python那一套，ue4像C#那一套） 更丰富的ctor 其实大部分时候有用的就只有C#那些（c++各种偏奇怪难特性根本无需去记，当c#写就行，你看c#大部分特性写的时候也根本用不到，菜鸟教程）","link":"/2023/02/15/assets/C#%E7%9A%84%E8%BF%9B%E9%98%B6%E8%AF%AD%E8%A8%80%EF%BC%9AC++/"},{"title":"","text":"被讨厌的勇气 世界极其简单，人们随时可以获得幸福 决定我们的不是过去的“原因”，而是现在的“目的” 愤怒都是捏造出来的 不幸都是自己选择的 答案不应该是从别人那里得到，而应该是自己亲自找出来 一切都是你自己决定的 重要的不是被给予了什么，而是如何去利用被给予的东西 我们都活在主观世界中 阿德勒心理学是==勇于改变==的心理学 无论之前发生过什么，都对今后的人生没有影响 人际关系 每个人虽然不同但是平等 人越缺什么越显摆什么 在意你的人只有你自己 优秀的人都是孤独的 情绪没有价值，有价值的是建议 自卑感来自主观的臆造 是优点还是缺点是自己决定的 如果你不想被人打扰，那就别对对方做任何反应，然后离开 自卑情结只是一种不愿改变的借口 如果有人骄傲自大，那一定是因为他有自卑感 从胜负竞争中全身而退 承认错误，不代表你失败了 你是没有勇气去掌握更好的方式 “人人都是我的伙伴”才能真心的给予祝福 自由 人应该坚持自己喜欢的东西 每个人都有自己无法逃避的课题 我们并不是为了满足别人的期待而活着，我们没必要寻求认可 你的目标是变成更为强大的自己，而不是讨好他人 一切人际关系矛盾都起因于对别人课题的妄加干涉和自己的课题被人妄加干涉 自由就是被别人讨厌 如果自己什么也不缺，就不需要和任何人来往，尤其是那些与你相悖的人 “人际关系的主动权”永远掌握在自己手中 我们是自己人生的主人公，而非世界的中心 人际关系的起点是“课题分离”，重点是“共同体感觉” 真合适的人根本不会在意你什么，只会觉得你很可爱，刚好也与她的爱好兼容（比如宅基腐）","link":"/2023/02/15/assets/%E5%AB%8C%E3%82%8F%E3%82%8C%E3%82%8B%E5%8B%87%E6%B0%97/"},{"title":"","text":"女朋友，按理说只要能满足一部分需求就足矣： 情感寄托 陪伴的人 爱意泛滥 要求聊得来、不会讨厌、有好感就行 提供： 情感寄托 陪伴和爱 各取所需，最小需要，保持距离 其他还是和单身时一样： 自由 爱好 理想的对象大概是不存在的？Fantasy： giantess，futa，femdom，sub，service… 精神与条件高度契合 公平公正，门当户对 这大概就是独身的我与世界和解的最佳手段了吧 人生目标 广州海珠买房 开特斯拉L3 网易UE5技术专家 贯彻理想主义 追求精神文明 我选择做游戏，是因为我从小就发现自己在这方面有天赋，准确说，我擅于创作 准备150w(买房)+50w(家电装修)，女生再出50w，共200w首付400w按揭，月供21k，男生承担14k。稳定以后再买辆车，总共600w的房+100w的车，实现理想的现实基础 我自己选的人生，最适合自己的人生，向上追逐的目标，不成了、想休息了再停下来缓 我的勇气就是坚持追寻自我，即使在看破生活的真相之后。只不过这次多了心理上的退路 有钱就有了选择权，一切好的、我想要的 都是我的 小木曾雪菜此生唯一 - 冲结婚去 互相喜欢的人，无论对方什么样，都会互相喜欢。天作之合、比翼双飞、白头偕老，互为30亿中不可替代的唯一 你我各自努力，在最高处相汇 不需按世俗的观念活着，只需按我们自己的方式。你是世界上最重要的人，其他人都不重要 我喜欢 女攻、巨大娘、大鸡鸡少女（或者伪娘、男的勉强也行） 活好、主动、会照顾人、早安咬，和我一样付出型的，可以随意发泄性欲 所以我不会去青藤、大二之类相亲，我更适合网络上、游戏中的偶遇，那种情愫懵动的动力感（可能只是因为一个头像、一段话、一张图，但就是能比平白无力的文字打动我） 提醒自己不要因为觉得自己可能可以兼容就将就、就牺牲自我。恰恰相反，==应该坚持自己理想的生活，每天过得规律、充实、井井有条，人生苦短，不要虚度光阴==、未来无悔，逐渐去接近”那个人”，坚持理想 助力 十四年儿、龙女仆、凝浓、文少、kami、小徐、海归、名校、一线这样的，认知在一个层面上，多向上社交（有些适合做朋友，伴侣毕竟还看条件） 不回九江九江这地方顺了还行，一不顺瞬间陋形毕露，45岁前不用考虑回九江 根据经验，我的圈子： 可爱晒拍，传统二次，游戏人，小众哥特 反向圈子：教职，国有体制，世俗，强三次元","link":"/2023/02/15/assets/%E5%B0%8F%E6%9C%A8%E6%9B%BE%E9%9B%AA%E8%8F%9C/"},{"title":"","text":"总有一些人看着各方面都不错但是不符合主流审美而寡着。 圈内 可爱、设子圈 cos、少女圈 游戏、漫友圈 CS、海外圈 我喜欢纯粹、理想的人（所以我喜欢第五、独游） 我成为了儿时自己喜欢的人 女生存在就是为了服务男生的 丁克 从小就反对ghs 没有短板，高富帅、智才情我全都有 失去这样的男生是你一生的遗憾 付出，反付出，情绪推拉","link":"/2023/02/15/assets/%E7%BB%8F%E9%AA%8C/"},{"title":"","text":"最佳实践 保持勤俭节约的美德（低欲望） 坚持自我 沉默是金 课题分离（自我接纳，他者信赖，他者贡献） 一定要坚持自己喜欢的东西（打动人心的作品） 不讨好，不寻求认可，自我价值感高 了解自己：我怕被影响，先天克服不了，就不喜欢负面的，全身心对抗也效果寥寥。最好的做法就是切断影响 说话越多，对自己伤害也越深，触景、回忆生情，凡脱离本性是雪崩时候的每一片雪花。论话量 家[0, 1]易 中，10%于巅峰话量是最好的 年轻人，你要限制欲望，才能成功 能解决问题的办法，就是好办法 行为实践尽可能少使用手机 尽可能贴近本性，少社交 家庭影响无法磨灭，不可脱离、不可逃避的关系 每人面对的世界不同，无法调和的矛盾会慢慢暴露出来，改变不了他人，不存在更好的办法。最好的做法就是保持合适的不会互相讨厌的距离（与人相处，都应该如此） 爱情真实的自己 理想自己： 稳定 没性欲（不zw） 不玩游戏 健康、运动 随心所欲不逾矩 英语梦 坚持自我 春希就是一个止不住自己欲望的 世俗人的代表，相比之下，冬马要冷静、理性、有才华的多（我支持冬马）。春希是有渣男潜质的，他没有坚持等到自己至爱的人，所以他注定波折不幸福。而且，一旦下了决定，就要负起责任来，不应该再动情，但春希却没这样做 - 九之濑遥行为准则 尽可能少使用手机 尽可能少社交 少睡觉 反对性 我做好，你随意 一些不必要的，对生活不会有什么影响的社交，主要是网络和线下陌生社交，陌路人，尽可能的少。社交在精不在多 真正做到独身主义、个体心理 不考虑独身以外的事情，不进行无必要的社交…… 生性凉薄、理性寡情，独爱一人生活，为此无限努力，即使不认为是独身主义，行为也与独身主义毫无区别了 很多事情不是不能做，是咱们看透了，没必要做而已。他人即地狱 人与人就是有不可调和的矛盾的，不能改变别人，因为立场不同，每个人有每个人负责的课题 做人一定诚实，做真实的自己，光明磊落 我谈过9次恋爱，找过3次工作、其中后两次都只有1个月，我承认我的过去，因为我接受了，这是我的课题。至于对方是否接受，那是对方的课题。不接受，也不要紧，说明不合适，我还是会接纳自己，坚持自己的路（又不是无路可走，再说即使无路可走了，那也不是坏事） 无论怎样的结果，我接受，我为自己而活了，我活的是真实的自己，便无憾。而且，我不会再被人影响，因压力而改变自己的判断。我会对重要的人，坦诚相待 接受就是接受，不接受就是不接受，遮遮掩掩的只会是拖延并把问题严重化。一开始就开诚布公，把一切说清楚，考虑的人也考虑清楚，这样才能无缝的协作下去 公平、平等 人人不同而平等 不评价，不比较 建议的运动：5人制足球，游戏，乒乓颠球，骑车→跑步，游泳，篮球，羽毛球 独身主义 光明磊落 不卑不亢 最好的面对家人的方法，就是毫不说话 我本身就已经是给予女生权利&gt;&gt;男生的，所以在特权之上还要追求特权的，恕我只能严词义绝 应该说，女生在IT圈、在二次元圈、甚至足球圈，本就一直是享受特权的存在，这里可一直是女性友好 爱情观如果没有雪菜，春希和冬马会永远在一起，他俩是天生一对 如果春希和雪菜在一起多年后出现冬马，春希还是会动摇，可能会和冬马在一起，可能违心的维持和雪菜的关系 所以，还是要非常谨慎，因为你可能会和一个并非你最爱的人在一起。将就的感情、被迫的感情，不会幸福的 存在即是价值，价值即是勇气 有做好自己事情的责任 Resume身高：178cm 体重：66kg 年月：97年11月 城市：广州 家乡：江西九江 学历：211本 专业：计算机/通信 职业：程序设计 月薪：30k 家庭：三口之家 性格：外冷内热，理性安静 爱好：阅读、足球、ACG、出去玩 其他：丁克，注重平等，非颜控 支持开放交友，独立自由，接受被绿 Requirement身高：163cm 体重：50kg 年月：97~00 城市：广州 家乡：三线以上 学历：一本 专业：互补 职业：管理、外语 月薪：10k+ 家庭：温暖和谐 性格：外热内冷，感性活泼 爱好：外出 其他：丁克，注重平等，性格好，宁缺毋滥","link":"/2023/02/15/assets/%E6%88%91/"},{"title":"","text":"家里夏秋 3件T恤（白、黑网易纪念装，Herbel青） 2件灰、黑短裤（T恤运动） 7分裤 青蓝色 没啥用的白衬衫 鹰院短袖 纯白长袖 各种偏厚的长裤（黑、灰、棕） 在家可以只穿家居服，睡觉也可不穿衣服 冬 穿搭夏 厚T、薄T、衬衫、球衣，以及对应的短中裤搭配，总之够穿 一般也会分 巨热、热、29°温 三种温度穿 秋 长T2+薄卫衣+衬衫2，对应薄长裤3+1，够穿 还有种穿法是内搭+夹克、外套；长袖运动；西装校服 一般也会分 26°过渡、降温、略冷 三种温度穿 冬 卫衣","link":"/2023/02/15/assets/%E8%A1%A3%E6%9C%8D/"}],"tags":[{"name":"思考","slug":"思考","link":"/tags/%E6%80%9D%E8%80%83/"},{"name":"经历","slug":"经历","link":"/tags/%E7%BB%8F%E5%8E%86/"},{"name":"UE5","slug":"UE5","link":"/tags/UE5/"}],"categories":[],"pages":[]}