{"posts":[{"title":"Kira的博客搭建记录","text":"兜兜转转终于还是搭建了自己的博客。 本博客采用分代回收算法第0代为老生代，即该博客最终确定的效果。“很少修改”第1代为中生代，为该博客中间阶段的里程表效果。中间有添加可能会往前或往后push。一般可以留证，没必要删。-1代或2代为新生代，胡言乱语，读厚读繁，只要能写，自由发挥，虽不可言，但字最多（可能没发表出来就被删了）。定位类似“艺术家的费稿” 例：博客初建 想法颇多，建至中段 踩坑无数，终建完成 不知所言……每个阶段都有每个阶段的快乐。 鄙人秉性，还望海涵。 Hexo + GitHub GitHub仓库https://github.com/sols11/sols11.github.io 安装Hexo、Node.js等https://zhuanlan.zhihu.com/p/35668237 注册域名https://wanwang.aliyun.com/domain/ 安装插件和icarus主题https://github.com/uynad/uynad.github.io maybe need to modify theme/archive.styl… etc 配置ymlhttps://blog.peiyingchi.com/2020/02/25/hexo-icarus-settings 支持评论https://blog.csdn.net/sinat_37529938/article/details/111484179 谷歌、百度搜索收录https://zhuanlan.zhihu.com/p/100922816 写、预览然后推送格式： --- title: date: 2023 categories: tags: cover: --- &lt;!--more--&gt; --- hexo clean, hexo g, hexo d hexo s 预览 寻找图床提交GitHub备份git branch -b blog move .git git push 关联坚果云source/_post Fix BugPowerShell无法运行hexo命令","link":"/2023/02/13/Kira's%20Blog/"}],"tags":[],"categories":[{"name":"Dev","slug":"Dev","link":"/categories/Dev/"}],"pages":[{"title":"关于我","text":"自我介绍我是Kira，曾用的英文名是Garcia Anotts。我是一名UE5开发工程师，曾经也在上学时、在网易游戏使用Unity、Messiah引擎开发过一些游戏。我的主要创作生涯经历有： 高宠传（NMFlash 阿诺论坛） 魔塔nzt（Rpg Maker 66RPG） No game no life（光荣战棋SLG制作工具 轩辕春秋） 合金弹头S（Unity） Sunset（Unity 创新杯名次） 黎明之刃（Unity 微软id@xbox入选） CodeInvader（Unity in Netease，MiniGame） 命运：Viper（Messiah） 近月re（Ren’py） 逃学派对（Unreal in Netease，GameJam21获奖） Contractors（Unreal） 此外，也曾短暂参与过peropero、kidfansclub、梦幻西游三维版、鸣潮、铃兰之剑等组织或项目的开发。在这之中，黎明之刃(Dawnblade) 和 代码入侵者(CodeInvader) 使用了我自己设计的开发框架SFramework，这也是我的大学毕业设计成果。 上述经历中有很多发生在我小学到大学的时期，因为我在NCU游戏社（动漫社的分部）组建了创业工作室Sunset Game，以此名义产出了6部以上的游戏，且在校期间与西安科技大学、桂林电子科技大学信息科技学院等高校保持友好协作，举行了部分游戏制作比赛。 我掌握的技能编程语言：C++，C#，Python 游戏开发：Gameplay，关卡，Physics，Workflow（同时Blender一直想学） 日常：健身，做饭，英语，入门日语 我爱好看动漫、踢足球、学习、听歌、做游戏。 事实上工作劳累后最恢复我体力的方法就是听喜欢的音乐和重温经典番剧了。因为看新的，无论动漫、游戏、球赛什么的，都挺累的。 然后做饭、健身之类的有意义的事，也能给我莫大的能量，让我在疲惫之余有一丝空闲舒缓下来。 Favorite Table 喜欢的动漫Little Busters物语系列ef我们没有翅膀灰色三部曲来自新世界 喜欢的游戏ADV：近月系列ARPG：黑暗之魂3FTG：舞空烈战SPG：实况足球ACT：鬼泣DmcSLG：三国大战 喜欢的电影了不起的盖茨比凉宫春日的消失 喜欢的音乐阳炎Project系列Til the star burn blue 喜欢的书籍“勇气系列”时间揭秘 喜欢的小说凉宫春日物语绯弹的亚里亚 喜欢的角色艾斯豚·加拉哈·阿诺兹凛 喜欢的球队英超阿森纳德国队拜仁慕尼黑 还有一些喜欢的因为自己不够资深就没有列出来，比如 Monster Hunter、塞维利亚。另外，最喜欢看JAS系列的原创故事。 Why I write blogs?我为什么要写博客呢？因为我觉得这可以很好的整理自己的知识、心得，而且可以锻炼写作能力（程序员语文表达锻炼欠缺），相比于笔记更规整、正式、书面化。我的博客主要面向受众，是游戏开发者+共同爱好者，作为最理想的心灵交流载体，想在网络世界里寻得一片精神的净土。 博客书写风格：个人博客书写风格比较随机，毕竟主要是给自己带来享受的事物，不想约束过多，但总体会偏向简单直接，提供最少但最必要的有效信息。Simple is Better，博文风格like这篇 Kira’s Blog。 写在最后我是一个冷静、理性、善良、沉稳的人。 游戏研发的生涯辛苦而陡峭，但我心中确有梦想实现的游戏，我会努力去接近它。 about","link":"/about/index.html"},{"title":"","text":"","link":"/README.html"},{"title":"","text":"养成好习惯。 Facts配图肯定会比不配图的博客效果更好，但是找图片需要时间，所以在没时间的情况下先不配图。 Right Function[我们要了解事实， 事实是拿来给我们参考、帮我们排错，而不是拿来给我们自省的。 不是说放下道德，而是你对道德的理解有错。] 事先说明，不是教当渣男，而是如何正确的、不失体面(和地位)的恋爱。 举个例子，男女的两性差异客观存在 [男生要做的是什么？是在不损失自己已有优势的前提下，最大程度的从女生身上谋得好处] 谋得自己想要的异性价值，如情绪、玩乐、恋情和陪伴，而不影响自己的工作生活，就和打工不能倒贴一样。 我们分析女生想要什么，而我们能给什么？ CBD精英打工人，高IQ程序员，游戏开发天才，博客细心暖男，高 富 帅，好男人特质(公认)，有梦想的追梦主义者，母胎守身，爱读书爱学习爱成长等理想人设…… 其中，两件事情尽量避免，一个是认错，一个是求得，这两个行为最掉价。 你一定要记住你的受众只有她这一类人(喜欢你这些特质的)，其他所有人的看法你都不要管，我们会的已经足够多，我们的优秀程度已经足够出色，我们的特质独一无二，我们现在要做的就是为目标群众告知我们的存在。 所有女生都不会讨厌的特点： 高身高 帅 有钱 智商高 有天才般的创作能力 自律 有上进心 有面子 细心，有实证(可信赖)，有梦想 自尊心强 个人魅力（如果你能做到这种思维，你本身就很有魅力。再加上自己独特的魅力） 绝对不要再pua自己了，你就是最优秀的。最独一无二的 至于其他的，就是具体怎么相处。这里，最重要的一点，是尊重客观事实。也就是[在一些事情上，必须这么做才是对的；而另一些事情上，根据每个不同的女生而不同。] – 比如说女性生理结构这些事，它就是有标准答案的，你不好好对待她就不行（她身体会痛啊，她内心能明白你对待她不够好啊）。 – 而关于个人喜好如甜的辣的，胖的瘦的，暖的冷的，帅的丑的，就是主观向的了，但是，这些点根本不会影响你能不能和她发展，无非是你自己判断对方值不值得自己愿不愿和她发展了，主动权完全在自己手里。 在这些地方很多男生习惯性就垮掉了，还是古板思维太重了，觉得自己不符合就不能行了。 现在开始，你可以练手了，[一种方式是在实战中学习，一边学习一边成长]；另一种是时间宽裕的做法，即先看书、视频等方式学会一些知识，再在实战中磨炼和成长。 [选人的话，建议先选好相处的年轻、未见世面的女生开始，这样的女生很低成本就能满足。但若发现对面是个死脑筋或者有精神疾病或者心态观念有问题什么的就赶紧跑，不值得浪费精力换下一个（渣男都懒得骗的人）。] 然后再是喜欢程序员的，或是很少有机会接触程序员的，感到新奇，但自身价值又不低的女生。这些女生也是优而不卷值得相处的（比如Jas）。 那么实际相处的时候，也该根据交友事实，改变下咱个人的直男习惯了。无论对哪个女生，直男行为都是很下头的。这就包括要建立良好的第一印象，不能冷暴力，不能精虫上脑，不能直男癌聊天，不要吹b讲还没做到的话，注重细节等，这些都是公认的交友事实（至于非公认的，局部场合作用的，就暂且不管） 对于有一些男生他先天就不缺女人缘，这使得他可以更自如的和女性交往，但也不代表这就是更优的结果，因为我们掌握着更多的优点，无论相亲、工作、生活都无死角，也有更稳更好的结局控制（我相信，我将来会娶一个最优质的女性，“高点贩售”），这比大多数男性都好很多。而且这是最适合我的择偶方法(绝不吃亏) [如果忘记正确的择偶思维，参见 半佛。你是在择偶！不是求偶。] Right way, habits课题分离 思维是拿来让自己舒服的不舒服的打工没有意义","link":"/about/Tutor.html"},{"title":"关于学历","text":"学历，不过是“学力”的一种伪证罢了。 我能感受到学历越来越不值钱了。 从小时候起，我就不是一个喜欢学习、喜欢学校的孩子。 我现在倒是很喜欢学习，但依然不喜欢学校，不喜欢听老师讲课，不喜欢做学校里那些琐碎的事。 所以我没有读研。 本科时一如反故的拒绝读研。 工作后即使有动摇，或因为觉得“基础不够扎实”（本质上是学习不够勤奋），或因为觉得“学历title不够”（本质上是自身不够强），而想着升学历。 如果有一天，本科学历真的如此贬值，贬值到硕士需要遍地走，不是硕士连过敲门砖都困难的时候，我可能会去读研。或是为了出国工作，需要以留学为踏板，以及相信在国外读书体验会远胜国内，而去读研。 但是我依然为自己的本科学历而自豪。 凭着它，我足以进入网易，找到合适的工作；凭着它，我和武轻工、桂电科的小伙伴打成一片；学历高有些时候并不是加分项，正如网易校招时大家说的“学历越低进来的越厉害”。 而且学历，也越来越不能说明什么。 在学历崇拜明显的小红书，10个哈佛硕士9个教育学，高学历低能力遍地走的情况下，我越来越不倾向通过学历来判断一个人。 今日之清北，远非昔日之清北（不是说清北和清北学生不强）。 学历贬值，是必然趋势，但学历价值，不是。","link":"/about/Thinking/Degree.html"}]}